#+title: OA Endless Sky Mod
#+FILETAGS: :work:
* TODO "OA Endless Sky Mod" [0%]
:PROPERTIES:
:ORDERED:  t
:END:
** TODO plan "OA Endless Sky Mod" [3/6]
:PROPERTIES:
:ORDERED:  t
:END:
*** DONE capture your thoughts on "OA Endless Sky Mod" :think:@computer:
:PROPERTIES:
:EFFORT:   8min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-27 মঙ্গল 15:07]
CLOCK: [2025-05-27 মঙ্গল 15:01]--[2025-05-27 মঙ্গল 15:07] =>  0:06
:END:
<2025-05-27 মঙ্গল 15:15-15:23>
**** questions to ask during an initial project brainstorm
***** what is my goal or intention?
***** what do I already know about this project?
***** what don't I know that I need to find out?
***** what can I read or listen to for relevant ideas?
***** who can I talk to who might provide insights?
*** DONE search for notes related to "OA Endless Sky Mod" and dump them into the "basket" :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-27 মঙ্গল 15:12]
CLOCK: [2025-05-27 মঙ্গল 15:07]--[2025-05-27 মঙ্গল 15:12] =>  0:05
:END:
<2025-05-27 মঙ্গল 15:23-15:31>
**** make sure to scour the project archives as well
*** DONE consolidate the basket of "OA Endless Sky Mod" into a component outline :think:@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
CLOCK: [2025-05-27 মঙ্গল 15:13]--[2025-05-27 মঙ্গল 15:20] =>  0:07
:END:
<2025-05-27 মঙ্গল 15:31-15:36>

*** TODO break down the components of "OA Endless Sky Mod" into smaller ones :think:@computer:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-05-27 মঙ্গল 15:36-15:46>

*** TODO sketch out tasks of "OA Endless Sky Mod" :flow:@computer:
:PROPERTIES:
:EFFORT:   15min
:END:
<2025-05-27 মঙ্গল 15:46-16:00>

** TODO components [/]
:PROPERTIES:
:ORDERED:  t
:END:
**** research
***** research what factions there are
***** research is Endless Sky the best option to scaffold upon?
***** research how to make mods in general
***** research how to make Endless Sky mods
****** discuss this on the Forum
what
**** MVP [/]
**** multiple starts
**** star systems
***** use ChatGPT to convert descriptions on the EG of important star systems (the capital systems of Major Empires) to files for an ES mod
***** aliens
***** Muuh
***** Other Aliens
***** Caretaker Gods
***** Sephirotic Empires
****** Negentropist Alliance
******* Gevurah
****** Communion Of Worlds
******* Heartland
****** Technorapture Hypernation
******* Turing
***** Minor Factions
****** Stella Umma
****** The Eternal
****** Silicon Generation
***** Ahuman Empires
****** Diamond Network
****** Panvirtuality
***** interesting rareities
****** The Archivists
****** Crystallographer's Nightmare
****** Einstein's Revenge Cluster
***** fill in the gaps
**** planets
***** sprites
******** descriptions
**** spaceships
** TODO finish "OA Endless Sky Mod" [0/1]
:PROPERTIES:
:ORDERED:  t
:END:
*** TODO review my project for packets of work that I could reuse :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
*** TODO review my project to see what went right and what went wrong :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
